Revit 2024 API
FabricSheetType.Material Property
 The id of the material assigned to wires.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId Material { get; set; }
Visual Basic
Public Property Material As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ Material {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The sheetMaterial cannot map to a valid material element.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace